Revit 2026 API

# ViewHideElements Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void HideElements(
	ICollection<ElementId> elementIdSet
)
```
```vb
Public Sub HideElements (
	elementIdSet As ICollection(Of ElementId)
)
```
```cpp
public:
void HideElements(
	ICollection<ElementId^>^ elementIdSet
)
```
```fsharp
member HideElements :
        elementIdSet : ICollection<ElementId> -> unit
```

#### Parameters

elementIdSet ICollectionElementId

#### Reference

View Class

Autodesk.Revit.DB Namespace